; domain
;; source: ...
;; updates:
;;   - :negative-preconditions added
;;   - turn_to action has a new precondition (not (pointing ?s ?d_new))

(define (domain satellite)
    (:requirements :strips :typing :negative-preconditions)
    (:types
        satellite direction instrument mode
    )
    (:predicates
        (on_board ?i - instrument ?s - satellite)
        (supports ?i - instrument ?m - mode)
        (pointing ?s - satellite ?d - direction)
        (power_avail ?s - satellite)
        (power_on ?i - instrument)
        (calibrated ?i - instrument)
        (have_image ?d - direction ?m - mode)
        (calibration_target ?i - instrument ?d - direction)
    )

    (:action turn_to
        :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
        :precondition (and
            (pointing ?s ?d_prev)
            (not (pointing ?s ?d_new)))
        :effect (and
            (pointing ?s ?d_new)
            (not (pointing ?s ?d_prev)))
    )

    (:action switch_on
        :parameters (?i - instrument ?s - satellite)
        :precondition (and
            (on_board ?i ?s)
            (power_avail ?s))
        :effect (and
            (power_on ?i)
            (not (calibrated ?i))
            (not (power_avail ?s)))
    )

    (:action switch_off
        :parameters (?i - instrument ?s - satellite)
        :precondition (and (on_board ?i ?s)
            (power_on ?i))
        :effect (and (not (power_on ?i))
            (power_avail ?s))
    )

    (:action calibrate
        :parameters (?s - satellite ?i - instrument ?d - direction)
        :precondition (and (on_board ?i ?s)
            (calibration_target ?i ?d)
            (pointing ?s ?d)
            (power_on ?i))
        :effect (calibrated ?i)
    )

    (:action take_image
        :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
        :precondition (and (calibrated ?i)
            (on_board ?i ?s)
            (supports ?i ?m)
            (power_on ?i)
            (pointing ?s ?d))
        :effect (have_image ?d ?m)
    )
)

; problem
;; satellites=10, instruments=20, modes=3, directions=10, out_folder=training/easy, instance_id=95, seed=128

(define (problem satellite-95)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 sat9 sat10 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 ins16 ins17 ins18 ins19 ins20 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 dir9 dir10 - direction
    )
 (:init 
    (pointing sat1 dir4)
    (pointing sat2 dir7)
    (pointing sat3 dir9)
    (pointing sat4 dir6)
    (pointing sat5 dir3)
    (pointing sat6 dir8)
    (pointing sat7 dir1)
    (pointing sat8 dir3)
    (pointing sat9 dir6)
    (pointing sat10 dir9)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (power_avail sat9)
    (power_avail sat10)
    (calibration_target ins1 dir5)
    (calibration_target ins2 dir10)
    (calibration_target ins3 dir9)
    (calibration_target ins4 dir5)
    (calibration_target ins5 dir2)
    (calibration_target ins6 dir2)
    (calibration_target ins7 dir1)
    (calibration_target ins8 dir5)
    (calibration_target ins9 dir6)
    (calibration_target ins10 dir2)
    (calibration_target ins11 dir8)
    (calibration_target ins12 dir3)
    (calibration_target ins13 dir7)
    (calibration_target ins14 dir9)
    (calibration_target ins15 dir6)
    (calibration_target ins16 dir8)
    (calibration_target ins17 dir6)
    (calibration_target ins18 dir8)
    (calibration_target ins19 dir6)
    (calibration_target ins20 dir9)
    (on_board ins1 sat8)
    (on_board ins2 sat10)
    (on_board ins3 sat4)
    (on_board ins4 sat1)
    (on_board ins5 sat2)
    (on_board ins6 sat3)
    (on_board ins7 sat9)
    (on_board ins8 sat5)
    (on_board ins9 sat7)
    (on_board ins10 sat6)
    (on_board ins11 sat2)
    (on_board ins12 sat2)
    (on_board ins13 sat10)
    (on_board ins14 sat8)
    (on_board ins15 sat5)
    (on_board ins16 sat8)
    (on_board ins17 sat9)
    (on_board ins18 sat7)
    (on_board ins19 sat6)
    (on_board ins20 sat10)
    (supports ins17 mod1)
    (supports ins6 mod1)
    (supports ins18 mod2)
    (supports ins3 mod3)
    (supports ins5 mod2)
    (supports ins14 mod1)
    (supports ins4 mod3)
    (supports ins17 mod3)
    (supports ins13 mod1)
    (supports ins8 mod3)
    (supports ins14 mod3)
    (supports ins3 mod1)
    (supports ins20 mod2)
    (supports ins13 mod2)
    (supports ins5 mod1)
    (supports ins12 mod2)
    (supports ins15 mod1)
    (supports ins9 mod1)
    (supports ins11 mod1)
    (supports ins8 mod2)
    (supports ins11 mod3)
    (supports ins2 mod2)
    (supports ins19 mod2)
    (supports ins16 mod1)
    (supports ins7 mod2)
    (supports ins13 mod3)
    (supports ins2 mod3)
    (supports ins15 mod2)
    (supports ins16 mod2)
    (supports ins20 mod1)
    (supports ins10 mod3)
    (supports ins7 mod1)
    (supports ins2 mod1)
    (supports ins6 mod2)
    (supports ins3 mod2)
    (supports ins15 mod3)
    (supports ins1 mod2))
 (:goal  (and (pointing sat1 dir8)
   (pointing sat4 dir1)
   (pointing sat6 dir9)
   (pointing sat7 dir10)
   (pointing sat8 dir3)
   (have_image dir6 mod3)
   (have_image dir3 mod2)
   (have_image dir4 mod3)
   (have_image dir2 mod2)
   (have_image dir3 mod1)
   (have_image dir1 mod2))))

; plan
1. (turn_to sat7 dir10 dir1)
   deleted: (pointing sat7 dir1)
   added: (pointing sat7 dir10)
   goals met: 2 of 11
2. (turn_to sat6 dir9 dir8)
   deleted: (pointing sat6 dir8)
   added: (pointing sat6 dir9)
   goals met: 3 of 11
3. (turn_to sat4 dir1 dir6)
   deleted: (pointing sat4 dir6)
   added: (pointing sat4 dir1)
   goals met: 4 of 11
4. (switch_on ins15 sat5)
   deleted: (power_avail sat5)
   added: (power_on ins15)
   goals met: 4 of 11
5. (turn_to sat5 dir6 dir3)
   deleted: (pointing sat5 dir3)
   added: (pointing sat5 dir6)
   goals met: 4 of 11
6. (calibrate sat5 ins15 dir6)
   added: (calibrated ins15)
   goals met: 4 of 11
7. (take_image sat5 dir6 ins15 mod3)
   added: (have_image dir6 mod3)
   goals met: 5 of 11
8. (turn_to sat5 dir2 dir6)
   deleted: (pointing sat5 dir6)
   added: (pointing sat5 dir2)
   goals met: 5 of 11
9. (take_image sat5 dir2 ins15 mod2)
   added: (have_image dir2 mod2)
   goals met: 6 of 11
10. (turn_to sat5 dir4 dir2)
   deleted: (pointing sat5 dir2)
   added: (pointing sat5 dir4)
   goals met: 6 of 11
11. (take_image sat5 dir4 ins15 mod3)
   added: (have_image dir4 mod3)
   goals met: 7 of 11
12. (turn_to sat5 dir1 dir4)
   deleted: (pointing sat5 dir4)
   added: (pointing sat5 dir1)
   goals met: 7 of 11
13. (take_image sat5 dir1 ins15 mod2)
   added: (have_image dir1 mod2)
   goals met: 8 of 11
14. (turn_to sat5 dir3 dir1)
   deleted: (pointing sat5 dir1)
   added: (pointing sat5 dir3)
   goals met: 8 of 11
15. (take_image sat5 dir3 ins15 mod1)
   added: (have_image dir3 mod1)
   goals met: 9 of 11
16. (take_image sat5 dir3 ins15 mod2)
   added: (have_image dir3 mod2)
   goals met: 10 of 11
17. (turn_to sat1 dir8 dir4)
   deleted: (pointing sat1 dir4)
   added: (pointing sat1 dir8)
   goals met: 11 of 11
